#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cloudops-practice/cloudops-practice/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cloudops-practice/cloudops-practice

To view this run in a browser, visit:
https://app.terraform.io/app/andrewdq/cloudops-practice/runs/run-DHQTo6Fbg41JtfHP

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
module.resource_groups["southeastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg]
data.azurerm_client_config.current: Reading...
module.resource_groups["eastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xMjIwMzZjMi02YTQ4LTQxODAtYWUyZC1jZmEwZjIzZTBkZjA7b2JqZWN0SWQ9MWRlYmU3NTItZDJhZS00ZTI1LTljMjUtNzc4ZTkzM2U1ZmMwO3N1YnNjcmlwdGlvbklkPTY5NDIxYTAzLWY4ZTYtNGExZS04MWIzLTA3N2FhZWVhNWNlNzt0ZW5hbnRJZD0xNGJhMzgwYi1iOTNhLTRmYzEtYjRlZi04MDM5Y2NhNjFkNzU=]
data.azuread_service_principal.current: Reading...
data.azuread_service_principal.current: Read complete after 1s [id=/servicePrincipals/1debe752-d2ae-4e25-9c25-778e933e5fc0]
azurerm_postgresql_flexible_server.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql]
module.primary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet]
module.primary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg]
module.primary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.primary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/app]
azurerm_postgresql_flexible_server_database.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/databases/roadmap_maker]
azurerm_postgresql_flexible_server_active_directory_administrator.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/administrators/1debe752-d2ae-4e25-9c25-778e933e5fc0]
azurerm_postgresql_flexible_server_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAzureServices]
azurerm_postgresql_flexible_server_firewall_rule.aks_subnet: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAKSSubnet]
module.primary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.primary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.primary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks"
        name                                = "roadmap-maker-primary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "primary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "primary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "primary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "primary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.secondary_aks.azurerm_kubernetes_cluster.default will be created
  + resource "azurerm_kubernetes_cluster" "default" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "roadmap-maker-secondary"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = false
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32.5"
      + location                            = "eastasia"
      + name                                = "roadmap-maker-secondary-aks"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "roadmap-maker-eastasia-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "application"  = "roadmap-maker"
          + "cluster-type" = "secondary"
          + "environment"  = "prod"
          + "managed-by"   = "terraform"
          + "project"      = "cloudops-practice"
          + "region"       = "secondary"
        }
      + workload_identity_enabled           = false

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = 50
          + name                 = "default"
          + node_count           = 2
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 32
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + tags                 = {
              + "application"  = "roadmap-maker"
              + "cluster-type" = "secondary"
              + "environment"  = "prod"
              + "managed-by"   = "terraform"
              + "project"      = "cloudops-practice"
              + "region"       = "secondary"
            }
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile {
          + dns_service_ip          = "172.17.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "172.17.0.0/16"
          + service_cidrs           = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @AndrewDoan01, Action: `pull_request`*